# Chapter 10 Data Aggregation and Group Operations

- Split a data frame into pieces using one or more keys.
- Calculate group summary statistics such as count, mean, standard deviation, or a user-defined function.
- Apply within-group transformations such as normalization.
- Compute pivot tables and cross-tabulations.
- Perform statistical group analysis.

## I. GroupBy Mechanics

Many data processing follows a **split-apply-combine** process. For example, you may want to do the following operations to analyze a dataset about sales:
1. What is the total revenue every day?
2. What is the total sales of each product?
3. How much has each client perchased in total?

These operations all requires that you split the data into groups, and then apply certain calculations to each of the groups, and finally combine all results into a new table. In Pandas this is mostly done with `groupby()` function.

In [1]:
import numpy as np
import pandas as pd

In [3]:
# An example:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.395494  0.929851
1    a  two -0.471687  0.130195
2    b  one -0.803664  0.769901
3    b  two  1.163361  0.459188
4    a  one -0.993663  0.746376

In [4]:
# Split data1 values according to key1:
groups = df['data1'].groupby(df['key1'])
groups

In [7]:
# Apply mean() function to find the average value for each group
means = groups.mean()
means

key1
a   -0.356619
b    0.179848
Name: data1, dtype: float64

In [11]:
# Convert it to a data frame
df_means = means.to_frame(name='data1_mean')
df_means

      data1_mean
key1
a      -0.356619
b       0.179848

In [12]:
# Put all operations in one statement
df_means = df['data1'].groupby(df['key1']).mean().to_frame(name='data1_mean')
df_means

      data1_mean
key1
a      -0.356619
b       0.179848

In [13]:
# Exercise: split data2 according to key2, and calculate the sum.

We can use more than one column as keys.

In [14]:
# Split the data according to both key1 and key2
groups = df['data1'].groupby([df['key1'], df['key2']])

In [16]:
# Calculate the mean
means = groups.mean()
means

key1  key2
a     one    -0.299084
      two    -0.471687
b     one    -0.803664
      two     1.163361
Name: data1, dtype: float64

We obtain a pandas Series with **hierarchical indexing**. It can be converted to a data frame using `unstack()`.

In [19]:
# Convert it to a data frame
means.unstack()

key2       one       two
key1
a    -0.299084 -0.471687
b    -0.803664  1.163361

In [20]:
# Put all operations in one statement

In [23]:
# Split the entire data frame
df.groupby([df['key1'], df['key2']]).mean()

              data1     data2
key1 key2
a    one  -0.299084  0.838113
     two  -0.471687  0.130195
b    one  -0.803664  0.769901
     two   1.163361  0.459188

In [25]:
# Frequently the grouping information is found in the same data frame as the data 
# you want to work on. In that case, simply put column names as the keys:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.299084  0.838113
     two  -0.471687  0.130195
b    one  -0.803664  0.769901
     two   1.163361  0.459188

In [28]:
# Find the number of instances in each subgroup
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

**Iterating Over Groups**

The GroupBy object support iteration, providing a sequence of 2-tuples containing the group name along with the data.

In [29]:
# Show the content of each group.
groups = df.groupby(['key1', 'key2'])
for name, group in groups:
    print("Name:", name)
    print(group)

Name: ('a', 'one')
  key1 key2     data1     data2
0    a  one  0.395494  0.929851
4    a  one -0.993663  0.746376
Name: ('a', 'two')
  key1 key2     data1     data2
1    a  two -0.471687  0.130195
Name: ('b', 'one')
  key1 key2     data1     data2
2    b  one -0.803664  0.769901
Name: ('b', 'two')
  key1 key2     data1     data2
3    b  two  1.163361  0.459188

**Syntactic sugar**: selecting columns for groupby()

In [34]:
df.groupby('key1')['data1'].min()

key1
a   -0.993663
b   -0.803664
Name: data1, dtype: float64

In [36]:
df['data1'].groupby(df['key1']).min()

key1
a   -0.993663
b   -0.803664
Name: data1, dtype: float64

In [35]:
df.groupby('key1')[['data2']].min()

         data2
key1
a     0.130195
b     0.459188

In [37]:
df[['data2']].groupby(df['key1']).min()

         data2
key1
a     0.130195
b     0.459188

**Grouping with dictionary**

In [41]:
values = np.array([
    [100, 80, 95],
    [55, 60, 45],
    [70, 75, 90],
    [75, 70, 60],
    [60, 73, 75],
    [72, 63, 70]
])
data = pd.DataFrame(values,
                   columns=['Midterm', 'Project', 'Final'],
                   index=['Alics', 'Bob', 'Chris', 'Doug', 'Eva', "Frank"])
data

       Midterm  Project  Final
Alics      100       80     95
Bob         55       60     45
Chris       70       75     90
Doug        75       70     60
Eva         60       73     75
Frank       72       63     70

In [42]:
gender = {
    'Alics': 'F',
    'Bob': 'M',
    'Chris': 'M',
    'Doug': 'M',
    'Eva': 'F',
    'Frank': 'M'
}

In [43]:
# split the rows according to gender
data.groupby(gender).size()

F    2
M    4
dtype: int64

In [44]:
data.groupby(gender).mean()

   Midterm  Project  Final
F     80.0     76.5  85.00
M     68.0     67.0  66.25

**Grouping with functions**

Any function passed as a group key will be called once per index value, with the returned values being used as the group names.

In [47]:
data.groupby(lambda x: x[0]).mean()

   Midterm  Project  Final
A      100       80     95
B       55       60     45
C       70       75     90
D       75       70     60
E       60       73     75
F       72       63     70

**Example: Filling Missing Values with Group-Specific Values**

In [53]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.DataFrame(np.random.randn(8), index=states, columns=['Value'])
data.loc[['Vermont', 'Nevada', 'Idaho']] = np.nan
data['group_key'] = group_key
data

               Value group_key
Ohio        0.746745      East
New York   -0.506052      East
Vermont          NaN      East
Florida     0.489283      East
Oregon      0.998212      West
Nevada           NaN      West
California  0.816119      West
Idaho            NaN      West

In [54]:
# Fill the missing values with mean value

In [55]:
# Find the average value of eastern states and western states


# Fill missing values with group specific average

In [56]:
# Fill missing values with the following rule:
# East: 0.5
# West: -0.5

**Example: Random Sampling and Permutation**

In [58]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [59]:
# Randomly sample 5 rows

In [60]:
# Randomly sample 2 cards from each suit

**Example: Analyzing Cell Phone History**

In [7]:
# Load data
# https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/
url = "https://shanelynnwebsite-mid9n9g1q9y8tt.netdna-ssl.com/wp-content/uploads/2015/06/phone_data.csv"
# data = pd.read_csv(url, delimiter=",")
data = pd.read_csv(url, delimiter=",", index_col='index')
print(data.shape)
data.head(3)

(830, 6)

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile

1. **date**: The date and time of the entry
2. **duration**: The duration (in seconds) for each call, the amount of data (in MB) for each data entry, and the number of texts sent (usually 1) for each sms entry.
3. **item**: A description of the event occurring – can be one of call, sms, or data.
4. **month**: The billing month that each entry belongs to – of form ‘YYYY-MM’.
5. **network**: The mobile network that was called/texted for each entry.
6. **network_type**: Whether the number being called was a mobile, international (‘world’), voicemail, landline, or other (‘special’) number.

In [31]:
# Convert date column from string to datetime objects
from dateutil.parser import parse
data['date'] = data['date'].apply(parse, dayfirst=True)
data.head(3)

                     date  duration  item    month   network network_type
index
0     2014-10-15 06:58:00    34.429  data  2014-11      data         data
1     2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2     2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile

In [4]:
# Check data types

In [5]:
# Check missing values

**Apply GroupBy actions**

In [11]:
# Which months are covered in this data set?
data.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [8]:
# Find the first entry for each month
data.groupby(['month']).first()

                   date  duration  item   network network_type
month
2014-11  15/10/14 06:58    34.429  data      data         data
2014-12  13/11/14 06:58    34.429  data      data         data
2015-01  13/12/14 06:58    34.429  data      data         data
2015-02  13/01/15 06:58    34.429  data      data         data
2015-03  12/02/15 20:15    69.000  call  landline     landline

In [12]:
# Get the number of instances in each month

         date  duration  item  network  network_type
month
2014-11   230       230   230      230           230
2014-12   157       157   157      157           157
2015-01   205       205   205      205           205
2015-02   137       137   137      137           137
2015-03   101       101   101      101           101

In [13]:
# What is the sum of call durations for each month?

**Group by more than one variable**

In [14]:
# How many calls, messages, and data entries are there in each month?

In [15]:
# How many instances are there per month, split by network_type?

## II. Data Aggregation
Aggregation refer to any data transformation that produces numeric values from arrays. The preceding examples have used several of them, including `mean()`, `count()`, `first()`, `min()`, and `sum()`. However, user-defined functions can also be applied to create desired summary.

In [19]:
# Define function range() that returns(max - min)
def get_range(array):
    return array.max() - array.min()

In [20]:
# Apply agg() to find the range of each type of cell phone use.
data.groupby(['item'])['duration'].agg(get_range)

item
call    10527.0
data        0.0
sms         0.0
Name: duration, dtype: float64

In [22]:
# Apply multiple aggregation functions
data.groupby(['item'])['duration'].agg([get_range, np.max, np.min])

      get_range       amax    amin
item
call    10527.0  10528.000   1.000
data        0.0     34.429  34.429
sms         0.0      1.000   1.000

In [23]:
# Declare columns names
data.groupby(['item'])['duration'].agg([('range', get_range),
                                        ('maximum', np.max),
                                        ('minimum', np.min)])

        range    maximum  minimum
item
call  10527.0  10528.000    1.000
data      0.0     34.429   34.429
sms       0.0      1.000    1.000

In [28]:
# Apply a different function to each column
functions = {
    'duration': sum,
    'network_type': 'count',
    'date': 'first'
}
data.groupby(['month', 'item']).agg(functions)

               duration  network_type            date
month   item
2014-11 call  25547.000           107  15/10/14 06:58
        data    998.441            29  15/10/14 06:58
        sms      94.000            94  16/10/14 22:18
2014-12 call  13561.000            79  14/11/14 17:24
        data   1032.870            30  13/11/14 06:58
        sms      48.000            48  14/11/14 17:28
2015-01 call  17070.000            88  15/12/14 20:03
        data   1067.299            31  13/12/14 06:58
        sms      86.000            86  15/12/14 19:56
2015-02 call  14416.000            67  15/01/15 10:36
        data   1067.299            31  13/01/15 06:58
        sms      39.000            39  15/01/15 12:23
2015-03 call  21727.000            47  12/02/15 20:15
        data    998.441            29  13/02/15 06:58
        sms      25.000            25  19/02/15 18:46

In [33]:
# Tuple named aggregations
data[data['item'] == 'call'].groupby('month').agg(
    # Get max of the duration column for each group
    max_duration=('duration', max),
    # Get min of the duration column for each group
    min_duration=('duration', min),
    # Get sum of the duration column for each group
    total_duration=('duration', sum),
    # Apply a lambda to date column
    num_days=("date", lambda x: (max(x) - min(x)).days)    
)

         max_duration  min_duration  total_duration  num_days
month
2014-11        1940.0           1.0         25547.0        28
2014-12        2120.0           2.0         13561.0        30
2015-01        1859.0           2.0         17070.0        30
2015-02        1863.0           1.0         14416.0        25
2015-03       10528.0           2.0         21727.0        19

# Homework:
Use the cell phone usage data in this exercise.
1. Find out the network names that belongs to network_type "mobile".
2. How many messages were sent to each mobile network every month?
3. What is the total call duration to each mobile network every month?

In [34]:
data.groupby(['network_type', 'network']).count()

                        date  duration  item  month
network_type network
data         data        150       150   150    150
landline     landline     42        42    42     42
mobile       Meteor       87        87    87     87
             Tesco        84        84    84     84
             Three       215       215   215    215
             Vodafone    215       215   215    215
special      special       3         3     3      3
voicemail    voicemail    27        27    27     27
world        world         7         7     7      7

In [35]:
subdata = data[data['network_type'] == 'mobile']
subdata['network'].value_counts()

Three       215
Vodafone    215
Meteor       87
Tesco        84
Name: network, dtype: int64

In [36]:
subdata.groupby(['month', 'network']).count()

                  date  duration  item  network_type
month   network
2014-11 Meteor      23        23    23            23
        Tesco       23        23    23            23
        Three       64        64    64            64
        Vodafone    79        79    79            79
2014-12 Meteor      24        24    24            24
        Tesco       13        13    13            13
        Three       43        43    43            43
        Vodafone    28        28    28            28
2015-01 Meteor      31        31    31            31
        Tesco       15        15    15            15
        Three       59        59    59            59
        Vodafone    55        55    55            55
2015-02 Meteor       5         5     5             5
        Tesco       22        22    22            22
        Three       33        33    33            33
        Vodafone    30        30    30            30
2015-03 Meteor       4         4     4             4
        Tesco       11        11    11            11
        Three       16        16    16            16
        Vodafone    23        23    23            23

In [38]:
subdata[subdata['item'] == 'call'].groupby(['month', 'network'])['duration'].sum()

month    network
2014-11  Meteor       1521.0
         Tesco        4045.0
         Three       12458.0
         Vodafone     4316.0
2014-12  Meteor       2010.0
         Tesco        1819.0
         Three        6316.0
         Vodafone     1302.0
2015-01  Meteor       2207.0
         Tesco        2904.0
         Three        6445.0
         Vodafone     3626.0
2015-02  Meteor       1188.0
         Tesco        4087.0
         Three        6279.0
         Vodafone     1864.0
2015-03  Meteor        274.0
         Tesco         973.0
         Three        4966.0
         Vodafone     3513.0
Name: duration, dtype: float64